{
	"backend/main.mo": "Main backend actor implementing a prediction market platform with markets, user profiles, positions, transactions, comments, analytics, wallet balances, and access control including admin management functions.",
	"backend/migration.mo": "Migration module defining old actor state types and a run function that currently performs no transformations, simply returning the old state unchanged.",
	"feature_evidence.json": "Feature evidence report documenting four admin management features implemented in AdminPage.tsx and useQueries.ts with high confidence, including admin list display, add/remove admin forms, and React Query hooks.",
	"frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components, pages, hooks, and styling for the Vici prediction market application with authentication, market trading, portfolio management, and admin features.",
	"frontend/index.html": "HTML entry point with Vici branding, favicon reference to the coin logo, and root div for React mounting.",
	"frontend/src/App.tsx": "Root application component managing routing between pages, authentication state, profile setup modal, and access control that restricts portfolio, wallet, rush, profile, and admin pages to authenticated users.",
	"frontend/src/components/AccessDeniedScreen.tsx": "Full-screen component displaying a shield alert icon and login button when unauthenticated users attempt to access protected pages.",
	"frontend/src/components/Footer.tsx": "Footer component with Vici branding, resource links, social media icons for Twitter and GitHub, and caffeine.ai attribution.",
	"frontend/src/components/Header.tsx": "Main navigation header component with responsive menu, authentication controls, user profile dropdown, and navigation items (Home, Markets, Rush, Portfolio, Wallet, Leaderboard, Learn, Admin). Handles Internet Identity login/logout and displays user balance.",
	"frontend/src/components/MarketAnalyticsChart.tsx": "Displays market analytics with tabbed charts showing odds trends (line chart) and trading volume (bar chart) over time using Recharts library.",
	"frontend/src/components/MarketCard.tsx": "Card component displaying market summary including title, status badge, categories, YES/NO odds, expiration date, and invite-only indicator. Clickable to view full market details.",
	"frontend/src/components/MarketDepthPanel.tsx": "Shows market depth with current YES/NO forecasts, position summaries, and detailed tables of all YES and NO positions including amounts and average prices.",
	"frontend/src/components/MarketDiscussion.tsx": "Comment section for markets with posting functionality for authenticated users, comment display with timestamps, and moderation controls for admins to hide comments.",
	"frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new user onboarding that prompts for nickname and initializes user profile with 1,000 Ꝟ starting balance.",
	"frontend/src/components/ReceiveTokenPanel.tsx": "React component that displays the user's Principal ID with copy-to-clipboard functionality and generates a QR code for receiving ICP or ckUSDC tokens.",
	"frontend/src/components/SendTokenForm.tsx": "React form component for sending ICP or ckUSDC tokens with Principal ID validation and balance checking; currently shows a placeholder message indicating ledger integration is not yet implemented.",
	"frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous actor instance based on Internet Identity, invalidating dependent queries when the actor changes.",
	"frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
	"frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with the backend canister, including user profiles, friends management, markets, positions, transactions, comments, analytics, and wallet operations.",
	"frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes for UI components including sidebar, charts, and semantic colors.",
	"frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
	"frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabs for creating markets, resolving markets, granting ViciCoins to users, and managing admin roles with owner-only permissions for admin management.",
	"frontend/src/pages/HomePage.tsx": "Displays a searchable, filterable grid of prediction markets with tabs for all/trending/expiring/resolved markets. Includes search functionality and uses MarketCard components to render individual markets.",
	"frontend/src/pages/LeaderboardPage.tsx": "Shows a leaderboard of top traders ranked by Vici Coin balance, featuring a visual podium for top 3 users and a scrollable list for remaining ranks with trophy/medal icons.",
	"frontend/src/pages/LearnPage.tsx": "Landing/educational page with hero banner, stats section showing active markets and starting coins, and feature highlights explaining why users should trade on Vici.",
	"frontend/src/pages/MarketDetailPage.tsx": "Detailed view of a single prediction market with trading interface, market depth panel, analytics chart, discussion/comments section, and invite management for private markets.",
	"frontend/src/pages/MarketsPage.tsx": "Displays a searchable, filterable grid of prediction markets with tabs for all/trending/expiring/resolved markets, identical functionality to HomePage.",
	"frontend/src/pages/PortfolioPage.tsx": "User portfolio dashboard showing balance, open positions, and total invested with tabs for viewing active positions and transaction history in table format.",
	"frontend/src/pages/ProfilePage.tsx": "Profile management page displaying user nickname, principal ID, join date, and friends list with add/remove functionality. Includes form validation, error handling with toast notifications, and friend management via Principal IDs.",
	"frontend/src/pages/RushPage.tsx": "Rush betting mode page that presents markets sequentially with swipe gestures (left=NO, right=YES, up=skip) and keyboard shortcuts. Handles trade execution with amount input and advances through a queue of markets.",
	"frontend/src/pages/WalletPage.tsx": "Wallet management page displaying ICP and ckUSDC balances with send/receive tabs. Uses formatted balance display converting from smallest units (e8s) and integrates SendTokenForm and ReceiveTokenPanel components.",
	"frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, sidebar colors, chart colors, custom animations (accordion), and plugins for typography, container queries, and animations.",
	"project_state.json": "Project state tracking document for a prediction/betting app with friends system, private markets, rush betting mode, and IC wallet integration (ICP/ckUSDC). Includes architectural notes, known issues, and feature tracking with requirement IDs."
}
